app/Controllers/ProductoAPI.php

SELECT *
FROM `productos`
---
  public function index() {
    $lista = $this->productoModel->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '8'
---
  public function show($id) {
    $respuesta = $this->productoModel->find($id);