app/Controllers/Producto.php

INSERT INTO `productos` (`nombre`, `imagen`, `descripcion`, `precio`) VALUES ('asdfasdfasdf', 'sdsagsda', 'asdfasgdasd', '23423')
---
    public function store() {
        $productoModel = new ProductoModel();

        $datos = [
            "nombre" => $this->request->getVar("nombre"),
            "imagen" => $this->request->getVar("imagen"),
            "descripcion" => $this->request->getVar("descripcion"),
            "precio" => $this->request->getVar("precio"),
        ];

        $resultado = $productoModel->insert($datos);

DELETE FROM `productos`
WHERE `id` IN ('4')
---
    public function delete($id) {
        $productoModel = new ProductoModel();

        $productoModel->delete($id);

SELECT *
FROM `productos`
WHERE `productos`.`id` = '3'
---
    public function edit($id) {
        $productoModel = new ProductoModel();
        $producto = $productoModel->find($id);